/**
 * Created by root on 16/8/23.
 */
window.onload = function () {

    //  时令与热门
    var shiling = ["鸡肉","鸡翅","鸡蛋","牛肉","猪肉","排骨","小龙虾","皮皮虾","螃蟹","虾","扇贝","生蚝","黄瓜","茄子","西红柿","土豆","黑木耳","秋葵"];

    for(var i = 0;i <shiling.length;i++){
        $(".shiling").append("<li><a href='' target='_blank'>"+shiling[i]+"</a>");
    }

//    肉禽类

    var rouqin = ['猪肉','排骨','里脊','猪蹄','五花肉','肋排','牛肉','牛排','肥牛','羊肉','猪肝','猪肘','火腿','香肠','培根','腊肉','肉松','整鸡','鸡肉','鸡翅','鸡腿','乌鸡','鸭肉','乳鸽','鸡蛋','鸭蛋','鸭脖','鹅肝','鹌鹑','更多'];

    for(var i = 0;i<rouqin.length;i++){
        $('.rouqin').append("<li><a href='' target='_blank'>"+rouqin[i]+"</a>");
    }


//    水产品类

    var shuichan = ['草鱼','鲤鱼','鲫鱼','带鱼','鲈鱼','黄花鱼','鳕鱼','鲅鱼','鲳鱼','鳗鱼','三文鱼','胖头鱼','罗非鱼','秋刀鱼','多宝鱼','鱼籽','鱼尾','鱼丸','小龙虾','虾','龙虾','螃蟹','大闸蟹','皮皮虾','牡蛎','扇贝','生蚝','蛤蜊','蛏子','鲍鱼','海蜇','鱿鱼','海参','海带','紫菜','更多'];


        for(var i = 0;i<shuichan.length;i++){
            $('.shuichan').append("<li><a href='' target='_blank'>"+shuichan[i]+"</a>");
        }

//蔬菜
    var greens = ['白菜','油菜','青菜','芹菜','菠菜','韭菜','大白菜','娃娃菜','芦蒿','莴笋','油麦菜','芦笋','土豆','红薯','芋头','洋葱','萝卜','山药','西红柿','藕','豆角','茄子','青椒','菜花','豇豆','秋葵','毛豆','四季豆','黄瓜','冬瓜','西葫芦','黑木耳','蘑菇','香菇','金针菇','杏鲍菇','茭白','竹笋','荠菜','香椿','马兰头','更多'];

    for(var i = 0;i<greens.length;i++){
        $('.greens').append("<li><a href='' target='_blank'>"+greens[i]+"</a>");
    }

//    果品类
    var fruit = ['菠萝','草莓','芒果','木瓜','牛油果','百香果','栗子','花生','腰果','核桃','芝麻','莲子','枸杞','桂圆','黑芝麻','红枣','蓝莓','更多'];

    for( var i= 0;i<fruit.length;i++){
        $('.fruit').append("<li><a href='' target='_blank'>"+fruit[i]+"</a>");
    }
//   米面豆乳
    var mimian = ['糯米','小米','荞麦米','玉米','燕麦','米粉','面条','意大利面','糯米粉','红豆','绿豆','黄豆','豆腐','豆浆','腐竹','油豆腐','烤麸','豆皮','淡奶油','奶酪','酸奶','牛奶','芝士','巧克力','粉皮','粉丝','年糕','粉条','河粉','更多'];

    for(var i = 0;i<mimian.length;i++){

            $('.mimian').append("<li><a href='' target='_blank'>"+mimian[i]+"</a>");
    }


//        调味品
        var season = ['番茄酱','番茄沙司','豆瓣酱','豆瓣','豆豉','芥末酱','蜂蜜','醪糟','酱油','鸡精','干黄酱','更多'];
        for(var i = 0;i<season.length;i++){

                $('.season').append("<li><a href='' target='_blank'>"+season[i]+"</a>");
            }
//        药食
    var med = ['燕窝','阿胶','雪蛤','茯苓','党参','当归','银耳','枣','百合','黄芪','花胶','更多'];
    for(var i = 0;i<med.length;i++){

        $('.med').append("<li><a href='' target='_blank'>"+med[i]+"</a>");
    }

}